<a href="https://colab.research.google.com/github/Rohit1208/machine_learning/blob/main/HOUSE_PRICE_PREDICTION.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.read_csv("/content/Housing (1)(1).csv")

In [ ]:
df

        price  area  bedrooms  ...  parking  prefarea furnishingstatus
0    13300000  7420         4  ...        2       yes        furnished
1    12250000  8960         4  ...        3        no        furnished
2    12250000  9960         3  ...        2       yes   semi-furnished
3    12215000  7500         4  ...        3       yes        furnished
4    11410000  7420         4  ...        2        no        furnished
..        ...   ...       ...  ...      ...       ...              ...
540   1820000  3000         2  ...        2        no      unfurnished
541   1767150  2400         3  ...        0        no   semi-furnished
542   1750000  3620         2  ...        0        no      unfurnished
543   1750000  2910         3  ...        0        no        furnished
544   1750000  3850         3  ...        0        no      unfurnished

[545 rows x 13 columns]

ONE HOT ENCODING CHANGING CATERGORICAL VALUE INTO NUMERIC

In [ ]:
df['mainroad']=df['mainroad'].apply({'yes':1,'no':0}.get)
df['guestroom']=df['guestroom'].apply({'yes':1,'no':0}.get)
df['basement']=df['basement'].apply({'yes':1,'no':0}.get)
df['hotwaterheating']=df['hotwaterheating'].apply({'yes':1,'no':0}.get)
df['airconditioning']=df['airconditioning'].apply({'yes':1,'no':0}.get)
df['prefarea']=df['prefarea'].apply({'yes':1,'no':0}.get)
df['furnishingstatus']=df['furnishingstatus'].apply({'furnished':1,'semi-furnished':2,'unfurnished':3}.get)

In [ ]:
df.tail(5)

       price  area  bedrooms  ...  parking  prefarea  furnishingstatus
540  1820000  3000         2  ...        2         0                 3
541  1767150  2400         3  ...        0         0                 2
542  1750000  3620         2  ...        0         0                 3
543  1750000  2910         3  ...        0         0                 1
544  1750000  3850         3  ...        0         0                 3

[5 rows x 13 columns]

In [ ]:
x=df[['area','bedrooms','bathrooms','stories','mainroad','guestroom','basement','hotwaterheating','airconditioning','parking','prefarea','furnishingstatus']]
y=df['price']

In [ ]:
x.tail(5)

     area  bedrooms  bathrooms  ...  parking  prefarea  furnishingstatus
540  3000         2          1  ...        2         0                 3
541  2400         3          1  ...        0         0                 2
542  3620         2          1  ...        0         0                 3
543  2910         3          1  ...        0         0                 1
544  3850         3          1  ...        0         0                 3

[5 rows x 12 columns]

In [ ]:
y.tail()

540    1820000
541    1767150
542    1750000
543    1750000
544    1750000
Name: price, dtype: int64

SPLIT THE DATA INTO TRAINING AND TESTING

In [ ]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [ ]:
x_train

In [ ]:
y_train

In [ ]:
x_test

FITTING MODEL AND TRAINING MODEL

In [ ]:
from sklearn.linear_model import LinearRegression
lin=LinearRegression()

In [ ]:
lin.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
y_pred=lin.predict(x_test)

In [ ]:
y_pred

ACCURACY SCORE

In [ ]:
lin.score(x,y)

0.6785272558740083

TESTING NEW VALUE

In [ ]:
new_pred={'area':1341,'bedrooms':2,'bathrooms':2,'stories':1,'mainroad':1,'guestroom':0,'basement':1,'hotwaterheating':0,'airconditioning':0,'parking':1,'prefarea':1,'furnishingstatus':2}
index=[1]

new_pred_output=pd.DataFrame(new_pred,index)

In [ ]:
new_pred_output

   area  bedrooms  bathrooms  ...  parking  prefarea  furnishingstatus
1  1341         2          2  ...        1         1                 2

[1 rows x 12 columns]

In [ ]:
lin.predict(new_pred_output)

array([4563272.70622372])